CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
            if (DeviceConfig.useWiFi && CommsManagerState.wifiOnline)
            {
                send_result = sendDataViaWiFi(data, _pin, url);
                if (send_result)
                {
                    CommsManagerState.gsmFailCount = 0; // Reset on success
                    return true;
                }
                CommsManagerState.wifiFailCount++;
            }
        }
        break;

    case CommsManagerState.PreferredComm::NONE:
        // No preferred comms available, attempt either if configured
        if (DeviceConfig.useWiFi && CommsManagerState.wifiOnline)
        {
            Serial.println("SendData: Attempting WiFi (no preferred)...");
            send_result = sendDataViaWiFi(data, _pin, url);
            if (send_result)
                return true;
            CommsManagerState.wifiFailCount++;
        }

        if (DeviceConfig.useGSM && CommsManagerState.gsmOnline)
        {
            Serial.println("SendData: Attempting GSM (no preferred)...");
            send_result = sendDataViaGSM(data, _pin, url);
            if (send_result)
                return true;
            CommsManagerState.gsmFailCount++;
        }
        break;
    }

    if (!send_result)
    {
        Serial.println("SendData: Data transmission failed via all available methods - will retry later");
    }

    return send_result;
}

void init_memory_loggers()
{
    // Initialize memory loggers
    JSON_PAYLOAD_LOGGER.name = "JSON";
    JSON_PAYLOAD_LOGGER.path = SENSORS_JSON_DATA_PATH;
    JSON_PAYLOAD_LOGGER.type = DATA_LOGGERS::JSON;

    CSV_PAYLOAD_LOGGER.name = "CSV";
    CSV_PAYLOAD_LOGGER.path = SENSORS_CSV_DATA_PATH;
    CSV_PAYLOAD_LOGGER.type = DATA_LOGGERS::CSV;
}

static bool shouldUseTestingDataDir()
{
    return !DeviceConfig.isLive;
}

/// @brief Init directories for logging files
void init_SD_loggers()
{
    // Root directory
    createDir(SD, ROOT_DIR);

    char sensors_data_root_dir[128] = {};
    snprintf(sensors_data_root_dir, sizeof(sensors_data_root_dir), "%s%s", ROOT_DIR, BASE_SENSORS_DATA_DIR);
    createDir(SD, sensors_data_root_dir); // Create base sensor directory "/ESP_CHIP_ID/SENSORSDATA"

    bool use_testing_data_dir = shouldUseTestingDataDir();
    char sensors_data_parent_dir[128] = {};
    strcpy(sensors_data_parent_dir, sensors_data_root_dir);

    if (use_testing_data_dir)
    {
        strcat(sensors_data_parent_dir, TESTING_SENSORS_DATA_DIR);
        createDir(SD, sensors_data_parent_dir); // Create testing directory "/ESP_CHIP_ID/SENSORSDATA/TESTING"
    }

    bool use_testing_failed_store = shouldUseTestingDataDir();
    char failed_send_payloads_parent_dir[128] = {};

    if (use_testing_failed_store)
    {
        snprintf(failed_send_payloads_parent_dir, sizeof(failed_send_payloads_parent_dir), "%s%s", sensors_data_root_dir, TESTING_SENSORS_DATA_DIR);
        createDir(SD, failed_send_payloads_parent_dir);
    }
    else
    {
        strcpy(failed_send_payloads_parent_dir, sensors_data_root_dir);
    }

    // Init failed-payload path before the calendar check so retry storage follows the runtime live/testing state.
    snprintf(SENSORS_FAILED_DATA_SEND_STORE_PATH, sizeof(SENSORS_FAILED_DATA_SEND_STORE_PATH), "%s/%s",
             failed_send_payloads_parent_dir, SENSORS_FAILED_DATA_SEND_STORE_FILE);

    if (current_year != 0 && current_month != 0)
    {
        char _year[5] = {};
        snprintf(_year, sizeof(_year), "%d", current_year);
        snprintf(CURRENT_SENSORS_DATA_DIR, sizeof(CURRENT_SENSORS_DATA_DIR), "%s/%s", sensors_data_parent_dir, _year);

        createDir(SD, CURRENT_SENSORS_DATA_DIR); // Create year directory "/ESP_CHIP_ID/SENSORSDATA/2025"
    }

    else
    {
        Serial.println("Year or month not set");
        return;
    }

    memset(SENSORS_JSON_DATA_PATH, 0, sizeof(SENSORS_JSON_DATA_PATH));
    memset(SENSORS_CSV_DATA_PATH, 0, sizeof(SENSORS_CSV_DATA_PATH));
    char month[4] = {};
    getMonthName(current_month, month);

    // Update sensors JSON data path
    snprintf(SENSORS_JSON_DATA_PATH, sizeof(SENSORS_JSON_DATA_PATH), "%s/%s.txt", CURRENT_SENSORS_DATA_DIR, month);

    // Update sensors CSV data path
    snprintf(SENSORS_CSV_DATA_PATH, sizeof(SENSORS_CSV_DATA_PATH), "%s/%s.csv", CURRENT_SENSORS_DATA_DIR, month);

    int _from = 0;
    int _to = 0;
    if (readLine(SD, SENSORS_CSV_DATA_PATH, _to, _from, true) != (String)csv_header)
    {
        appendFile(SD, SENSORS_CSV_DATA_PATH, csv_header);
    }

    // write files to SD
    // writeFile(SD, SENSORS_JSON_DATA_PATH, "");                   // create file if it does not exist
    // writeFile(SD, SENSORS_FAILED_DATA_SEND_STORE_PATH, ""); // create file if it does not exist

    // Debug runtime logger;
}

static void updateLoggerPath(LOGGER &logger)
{
    switch (logger.type)
    {
    case DATA_LOGGERS::JSON:
        logger.path = SENSORS_JSON_DATA_PATH;
        break;
    case DATA_LOGGERS::CSV:
        logger.path = SENSORS_CSV_DATA_PATH;
        break;
    }
}

static void refreshLoggerPath(LOGGER &logger)
{
    init_SD_loggers();
    updateLoggerPath(logger);
}

/**
    @brief convert number of month to name
    @param month_num : range from 1 to 12
    @param month : name of the month
    @return : void
**/
void getMonthName(int month_num, char *month)
{
    switch (month_num)
    {
    case (Month::_JAN):
        strcpy(month, "JAN");
        break;

    case (Month::_FEB):
        strcpy(month, "FEB");
        break;

    case (Month::_MAR):
        strcpy(month, "MAR");
        break;

    case (Month::_APR):
        strcpy(month, "APR");
        break;

    case (Month::_MAY):
        strcpy(month, "MAY");
        break;

    case (Month::_JUN):
        strcpy(month, "JUN");
        break;

    case (Month::_JUL):
        strcpy(month, "JUL");
        break;
    case (Month::_AUG):
        strcpy(month, "AUG");
        break;
    case (Month::_SEP):
        strcpy(month, "SEP");
        break;
    case (Month::_OCT):
        strcpy(month, "OCT");
        break;
    case (Month::_NOV):
        strcpy(month, "NOV");
        break;
    case (Month::_DEC):
        strcpy(month, "DEC");
        break;
    }
}

/// @brief : Read data from SD card and send it to the server
/// @param datafile : file name to read from
/// @return : void
/// @note : The function will read the data from the file and send it to the server. If the send fails, the data will be appended to a temporary file for later sending.
/// @note : The function will also update the file contents to remove the data that was sent successfully.
void readSendDelete(const char *datafile)
{
    String data;
    const char *tempFile = "/temp_sensor_payload.txt";

    Serial.println("Attempting to send data that previoudly failed to send.");

    int next_byte = -1;
    int next_line_index = 0;

    // readline continously
    do
    {

        data = readLine(SD, datafile, next_byte, next_line_index, false);

        if (next_byte == -1) // End of file reached
        {
            Serial.println("End of file read");
        }

        if (!validateJson(data.c_str()))
        {
            Serial.println("Invalid JSON data: " + data);
            continue;
        }

        if (data != "")
        {
            JsonDocument doc;
            deserializeJson(doc, data);        // Extract API_PIN from the JSON data
            int api_pin = doc["API_PIN"] | -1; // Default to -1 if not found

            if (api_pin == -1)
            {
                Serial.println("API_PIN not found in JSON data ");
                continue; // Skip this data if API_PIN is not found
            }
            // Attempt send payload
            // Serial.println("Attempting to send data from SD card: " + data);
            if (!sendData(data.c_str(), api_pin, DeviceConfig.active_api_url))
            {
                // store data in temp file
                appendFile(SD, tempFile, data.c_str(), true);
            }
        }
    } while (next_byte != -1);

    updateFileContents(SD, datafile, tempFile);

