CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    // close files
    closeFile(SD, datafile);
}

void updateCalendarFromRTC()
{
    bool calendarUpdated = false;
    int year = RTC.getYear();
    int month = RTC.getMonth() + 1; // ESP32Time month is 0 based

    if (year > current_year)
    {
        Serial.print("Updating year from: ");
        Serial.print(current_year);
        Serial.print(" to: ");
        Serial.println(year);

        current_year = year;
        current_month = month; // Also update the month. Ideally, Jan.
        calendarUpdated = true;
    }
    else if (month > current_month)
    {
        Serial.print("Updating year from: ");
        Serial.print(current_month);
        Serial.print(" to: ");
        Serial.println(month);

        current_month = month;
        calendarUpdated = true;
    }
    if (calendarUpdated)
    {
        init_SD_loggers();
    }
}

void initCalender(int year, int month)
{
    Serial.print("Initializing calendar with year: ");
    Serial.print(year);
    Serial.print(" and month: ");
    Serial.println(month);
    if (year != 0 && month != 0)
    {
        current_year = year;
        current_month = month;
    }
}

/**
    @brief Log data to memory
    @param logger : logger to log the data to
    @param data : data to log
    @return : void
    @note : The function will log the data to the logger. If the logger is full, it will append the data to a file.
**/
void memoryDataLog(LOGGER &logger, const char *data)
{

    if (logger.log_count < logger.MAX_ENTRIES)
    {
        strcpy(logger.DATA_STORE[logger.log_count], data);
        Serial.println("Logged data: " + String(logger.DATA_STORE[logger.log_count]));
        logger.log_count++;
    }
    else
    {
        Serial.println("Logger data log count exceeded for " + String(logger.name));
        switch (logger.type)
        {
        case DATA_LOGGERS::JSON:
            // Append to JSON file
            fileDataLog(logger);
            send_now = true;
            break;
        case DATA_LOGGERS::CSV:
            fileDataLog(logger);
            resetLogger(logger);
            break;
        }
    }
}

/**
    @brief Log data to file
    @param logger : logger to log the data to
    @return : void
    @note : The function will log the data to the file. If the file is full, it will append the data to a new file.
**/
void fileDataLog(LOGGER &logger)
{
    refreshLoggerPath(logger);
    Serial.println("Logging data to file: " + String(logger.path));
    for (int i = 0; i < logger.MAX_ENTRIES; i++)
    {
        if (strlen(logger.DATA_STORE[i]) != 0)
        {
            appendFile(SD, logger.path, logger.DATA_STORE[i]);
        }
    }
}

/**
    @brief Reset logger
    @param logger : logger to reset
    @return : void
    @note : The function will reset the logger. It will clear the data store and set the log count to 0.
**/
void resetLogger(LOGGER &logger)
{
    logger.log_count = 0;
    memset(logger.DATA_STORE, 0, sizeof(logger.DATA_STORE));
}

/**
    @brief Send data from memory loggers
    @param logger : logger to send data from
    @return : void
    @note : The function will send the data from the logger. If the send fails, the data will be appended to a file for later sending.
**/
void sendFromMemoryLog(LOGGER &logger)
{
    for (int i = 0; i < logger.log_count; i++)
    {
        if (strlen(logger.DATA_STORE[i]) != 0)
        {
            JsonDocument doc;
            deserializeJson(doc, logger.DATA_STORE[i]); // Extract API_PIN from the JSON data
            int api_pin = doc["API_PIN"] | -1;
            if (api_pin != -1)
            {
                if (!sendData(logger.DATA_STORE[i], api_pin, DeviceConfig.active_api_url))
                {
                    // Append to file for sending later // ToDo: Check the state of DeviceConfigState.sdCardInitialized before attempting to write to SD card
                    appendFile(SD, SENSORS_FAILED_DATA_SEND_STORE_PATH, logger.DATA_STORE[i]);
                }
            }

            memset(logger.DATA_STORE[i], '\0', 255);
        }
    }
    logger.log_count = 0;

    //? call resetLogger(logger) to reset the logger
    //? or just clear the memory
}

// Get current sensor data;

JsonDocument getCurrentSensorData()
{
    return current_sensor_data;
}

void captureGSMInfo()
{
    // ToDo: Reduce memory footprint by moving global gsm_info doc to  scoped local variable asyncwebserver
    gsm_info["Network Name"] = GSMRuntimeInfo.operator_name = getNetworkName();
    // gsm_info["Network Band"] = GSMRuntimeInfo.network_band = getNetworkBand();
    gsm_info["Signal Strength"] = GSMRuntimeInfo.signal_strength = getSignalStrength();
    strcpy(GSMRuntimeInfo.sim_ccid, SIM_CCID);
    gsm_info["SIM ICCID"] = GSMRuntimeInfo.sim_ccid;
    gsm_info["Model ID"] = GSMRuntimeInfo.model_id = getModelID();
    gsm_info["Firmware Version"] = GSMRuntimeInfo.firmware_version = getFirwmareVersion();
    gsm_info["IMEI"] = GSMRuntimeInfo.imei = getIMEI();
}

void configDeviceFromWiFiConn()
{

    captureWiFiInfo();

    if (!DeviceConfigState.timeSet)
    {
        // synchronise system clock over NTP
        configTime(0, 0, "pool.ntp.org", "time.nist.gov");
        time_t now = time(nullptr);
        RTC.setTime(now);
        initCalender(RTC.getYear(), RTC.getMonth() + 1);
        DeviceConfigState.timeSet = true;
    }
}

void captureWiFiInfo()
{
    wifi_info["SSID"] = WiFi.SSID();
    wifi_info["BSSID"] = WiFi.BSSIDstr();
    wifi_info["Signal Strength"] = WiFi.RSSI();
    wifi_info["IP Address"] = WiFi.localIP().toString();
}

/**
    @brief Initialize and configure GSM module
    @details This function handles GSM serial initialization, GSM module initialization,
             network registration with timeout, GPRS initialization, time fetching, and puts GSM to sleep.
    @return : void
**/
void initializeAndConfigGSM()
{
    DeviceConfigState.state = ConfigurationState::CONFIG_GSM;
    DeviceConfigState.gsmConnected = GSM_Serial_begin();

    if (!DeviceConfigState.gsmConnected)
        return;
    DeviceConfigState.gsmConnected = GSM_init();
    if (!DeviceConfigState.gsmConnected)
        return;

    // Check if CA certificate is present in the filesytem
    if (!GsmFileCheck(MOZILLA_PEM_FILENAME))
    {
        Serial.print("Writing modem file: ");
        Serial.println(MOZILLA_PEM_FILENAME);

        if (!GsmWriteFile(MOZILLA_PEM_FILENAME, MOZILLA_CA_BUNDLE))
        {
            Serial.println("Failed to write to file");
        }
        else
        {
            if (!setCACert(MOZILLA_PEM_FILENAME))
            {
                Serial.println("Failed to set CA certificate for secure connections");
            }
        }
    }
    else
    {
        if (!setCACert(MOZILLA_PEM_FILENAME))
        {
            Serial.println("Failed to set CA certificate for secure connections");
        }
    }

    // GSM initialization successful
    GSM_CONNECTED = true; // TODO: Refactor to remove global variable and use state struct instead

    NetMode modes[] = {NetMode::AUTO, NetMode::_2G, NetMode::_4G};
    bool network_registered = false;

