CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    for (auto mode : modes) {
        if (setNetworkMode(mode) && register_to_network()) {
            network_registered = true;
            break;
        }
    }

    if (!network_registered) {
        Serial.println("Failed to register to GSM network");
        return;
    }
    

    // GPRS initialization
    DeviceConfigState.gsmInternetAvailable = GPRS_init();
    CommsManagerState.gsmOnline = DeviceConfigState.gsmInternetAvailable;
    CommsManagerState.allCommsUnavailable = !DeviceConfigState.gsmInternetAvailable;

    // Fetch network time and update RTC
    if (!DeviceConfigState.timeSet)
    {
        if (getNetworkTime(time_buff))
        {
            // Update RTC time and calendar
            Serial.println("GSM Network Time: " + String(time_buff));
            esp_datetime_tz = extractDateTime(String(time_buff));
            RTC.setTime(esp_datetime_tz.timestamp);
            initCalender(RTC.getYear(), RTC.getMonth() + 1);
            DeviceConfigState.timeSet = true;
        }
        else
        {
            Serial.println("Failed to fetch time from network");
        }
    }
    if (DeviceConfigState.gsmInternetAvailable && DeviceConfigState.isMQTTConfigured && !CommsManagerState.mqttConnectionInitialized)
    {
        MQTT_configure(MQTT_CLIENT_ID, 1, 1);
        CommsManagerState.mqttConnectionInitialized = MQTT_open(MQTT_CLIENT_ID, MQTT_BROKER, MQTT_PORT);
        MQTT_connect(MQTT_CLIENT_ID, esp_chipid, MQTT_USERNAME, MQTT_PASSWORD);
        MQTT_subscribe(MQTT_CLIENT_ID, 1, MQTT_SUBSCRIBE_TOPIC, 0);
    }
    captureGSMInfo();
    GSM_sleep();
}

void loadInitialConfigs()
{

#if defined(POWER_SAVING_MODE)
    DeviceConfig.power_saving_mode = POWER_SAVING_MODE;
#endif
#if defined(GSM_APN)
    strncpy(DeviceConfig.gsm_apn, GSM_APN, sizeof(DeviceConfig.gsm_apn) - 1);
    DeviceConfig.gsm_apn[sizeof(DeviceConfig.gsm_apn) - 1] = '\0';
#endif
#if defined(GSM_APN_PWD)
    strncpy(DeviceConfig.gsm_apn_pwd, GSM_APN_PWD, sizeof(DeviceConfig.gsm_apn_pwd) - 1);
    DeviceConfig.gsm_apn_pwd[sizeof(DeviceConfig.gsm_apn_pwd) - 1] = '\0';
#endif
#if defined(WIFI_STA_SSID)
    strncpy(DeviceConfig.wifi_sta_ssid, WIFI_STA_SSID, sizeof(DeviceConfig.wifi_sta_ssid) - 1);
    DeviceConfig.wifi_sta_ssid[sizeof(DeviceConfig.wifi_sta_ssid) - 1] = '\0';
#endif
#if defined(WIFI_STA_PWD)
    strncpy(DeviceConfig.wifi_sta_pwd, WIFI_STA_PWD, sizeof(DeviceConfig.wifi_sta_pwd) - 1);
    DeviceConfig.wifi_sta_pwd[sizeof(DeviceConfig.wifi_sta_pwd) - 1] = '\0';
#endif
#if defined(SIM_PIN)
    strncpy(DeviceConfig.sim_pin, SIM_PIN, sizeof(DeviceConfig.sim_pin) - 1);
    DeviceConfig.sim_pin[sizeof(DeviceConfig.sim_pin) - 1] = '\0';
#endif

    if (gsm_capable)
        DeviceConfig.useGSM = use_gsm;

    DeviceConfig.useWiFi = use_wifi;

    if (!DeviceConfig.useWiFi && !DeviceConfig.useGSM)
        DeviceConfigState.configurationRequired = true;

#if defined(MQTT_BROKER) && defined(MQTT_USERNAME) && defined(MQTT_PASSWORD)
    if (MQTT_BROKER[0] != '\0' && MQTT_USERNAME[0] != '\0' && MQTT_PASSWORD[0] != '\0')
    {
        DeviceConfigState.isMQTTConfigured = true;
    }
#endif

    strcpy(DeviceConfig.production_url, PRODUCTION_URL);
    strcpy(DeviceConfig.staging_url, STAGING_URL);

#if defined(IS_LIVE)
    DeviceConfig.isLive = (IS_LIVE != 0);
    if (DeviceConfig.isLive)
    {
        strcpy(DeviceConfig.active_api_url, DeviceConfig.production_url);
    }
    else
    {
        strcpy(DeviceConfig.active_api_url, DeviceConfig.staging_url);
    }
#else
    DeviceConfig.isLive = false;
    strcpy(DeviceConfig.active_api_url, DeviceConfig.staging_url);
#endif

    Serial.println("Firmware Device Configs:");
    Serial.print("  wifi_sta_ssid: ");
    Serial.println(DeviceConfig.wifi_sta_ssid);
    Serial.print("  wifi_sta_pwd: ");
    Serial.println(DeviceConfig.wifi_sta_pwd);
    Serial.print("  gsm_apn: ");
    Serial.println(DeviceConfig.gsm_apn);
    Serial.print("  gsm_apn_pwd: ");
    Serial.println(DeviceConfig.gsm_apn_pwd);
    Serial.print("  sim_pin: ");
    Serial.println(DeviceConfig.sim_pin);
    Serial.print("  power_saving_mode: ");
    Serial.println(DeviceConfig.power_saving_mode ? "true" : "false");
    Serial.print("  useWiFi: ");
    Serial.println(DeviceConfig.useWiFi ? "true" : "false");
    Serial.print("  useGSM: ");
    Serial.println(DeviceConfig.useGSM ? "true" : "false");
    Serial.print("  isLive: ");
    Serial.println(DeviceConfig.isLive ? "true" : "false");
    Serial.print("  active_api_url: ");
    Serial.println(DeviceConfig.active_api_url);
    Serial.print("  staging_url: ");
    Serial.println(DeviceConfig.staging_url);
    Serial.print("  production_url: ");
    Serial.println(DeviceConfig.production_url);

    // if (DeviceConfig.power_saving_mode)
    //     {
    //         sampling_interval = 15 * 60 * 1000; // 15 minutes
    //         sending_intervall_ms = 60 * 60 * 1000; // 1 hour
    //     }
    // else
    //     {
    //         sampling_interval = 1 * 60 * 1000; // 1 minute
    //         sending_intervall_ms = 5 * 60 * 1000; // 5 minutes
    //     }
}

/**
 * @brief Ping a server to verify internet connectivity
 * @param server : Server address/hostname to ping
 * @param port : Port number (typically 80 for HTTP, 443 for HTTPS)
 * @param timeout_ms : Timeout in milliseconds
 * @return : true if ping successful, false otherwise
 * @note : This function simplistically checks connectivity by attempting a TCP connection
 */
bool pingServer(const char *server, uint16_t port, uint16_t timeout_ms)
{
    if (server == nullptr)
        return false;

    // Try WiFi if available
    if (DeviceConfig.useWiFi && DeviceConfigState.wifiConnected)
    {
        bool wifi_internet_access = wifiHasInternet(server, port, timeout_ms);
        if (wifi_internet_access)
        {
            return true;
        }
    }

    // Try GSM if WiFi failed and GSM is available
    if (DeviceConfig.useGSM && DeviceConfigState.gsmConnected && GPRS_CONNECTED)
    {
        bool ping_success = pingIP(server);

        if (ping_success)
            return true;
    }

