CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    return false;
}

/**
 * @brief Check if any communication method has internet connectivity
 * @details Attempts to ping a known server to verify actual internet availability
 *          Updates DeviceConfigState.wifiOnline and gsmOnline flags
 * @return : true if any communication is available, false if all failed
 */
bool isConnectivityAvailable()
{
    const char *PING_SERVER = "8.8.8.8";
    const uint16_t PING_PORT = 53;
    const uint16_t PING_TIMEOUT = 5000;

    unsigned long now = millis();

    // Perform connectivity check at regular intervals (every 15 minutes) to avoid excessive pinging
    if (now - CommsManagerState.lastConnectivityCheck < 60000 * 15)
    {
        return !CommsManagerState.allCommsUnavailable;
    }

    CommsManagerState.lastConnectivityCheck = now;

    // Check WiFi connectivity
    if (DeviceConfig.useWiFi && DeviceConfigState.wifiConnected)
    {
        CommsManagerState.wifiOnline = pingServer(PING_SERVER, PING_PORT, PING_TIMEOUT);
        if (CommsManagerState.wifiOnline)
        {
            return true;
        }
    }
    else
    {
        CommsManagerState.wifiOnline = false;
    }

    // Check GSM connectivity
    if (DeviceConfig.useGSM && DeviceConfigState.gsmConnected && DeviceConfigState.gsmInternetAvailable)
    {
        CommsManagerState.gsmOnline = pingServer(PING_SERVER, PING_PORT, PING_TIMEOUT);
        if (CommsManagerState.gsmOnline)
        {
            return true;
        }
    }
    else
    {
        CommsManagerState.gsmOnline = false;
    }

    // Both comms unavailable
    CommsManagerState.allCommsUnavailable = !(CommsManagerState.wifiOnline || CommsManagerState.gsmOnline);
    return !CommsManagerState.allCommsUnavailable;
}

/**
 * @brief Update communication preference based on current state
 * @details Determines the best communication method to use based on:
 *          - Device configuration preferences (useWiFi, useGSM)
 *          - Communication priority settings
 *          - Current connectivity status
 *          - Failure counts and retry logic
 */
void updateCommsPreference()
{
    unsigned long now = millis();

    // Determine if we should attempt to reconnect to failed comms
    bool attemptWiFi = (DeviceConfig.wifi_sta_ssid[0] != '\0') && DeviceConfig.useWiFi &&
                       (CommsManagerState.wifiFailCount < CommsManagerState.MAX_RETRY_ATTEMPTS) &&
                       (now - CommsManagerState.lastWiFiAttempt > CommsManagerState.reconnectInterval);

    bool attemptGSM = DeviceConfig.useGSM &&
                      (CommsManagerState.gsmFailCount < CommsManagerState.MAX_RETRY_ATTEMPTS) &&
                      (now - CommsManagerState.lastGSMAttempt > CommsManagerState.reconnectInterval);

    // Determine preferred communication based on priority and online status
    if (CommunicationPriority::WIFI == 0) // WiFi has priority
    {
        if (CommsManagerState.wifiOnline)
        {
            CommsManagerState.preferredComm = CommsManagerState.PreferredComm::WIFI;
            CommsManagerState.wifiFailCount = 0; // Reset fail count on successful connection
            return;
        }
        else if (CommsManagerState.gsmOnline)
        {
            CommsManagerState.preferredComm = CommsManagerState.PreferredComm::GSM;
            CommsManagerState.gsmFailCount = 0;
            return;
        }
    }
    else if (CommunicationPriority::GSM == 0) // GSM has priority
    {
        if (CommsManagerState.gsmOnline)
        {
            CommsManagerState.preferredComm = CommsManagerState.PreferredComm::GSM;
            CommsManagerState.gsmFailCount = 0;
            return;
        }
        else if (CommsManagerState.wifiOnline)
        {
            CommsManagerState.preferredComm = CommsManagerState.PreferredComm::WIFI;
            CommsManagerState.wifiFailCount = 0;
            return;
        }
    }

    // If here, preferred comms is not available, attempt reconnection if allowed
    if (attemptWiFi && DeviceConfig.useWiFi && !CommsManagerState.wifiOnline)
    {
        Serial.println("CommsManager: Attempting WiFi reconnection...");
        CommsManagerState.lastWiFiAttempt = now;
        CommsManagerState.wifiFailCount++;

        // For WiFi, attempt to reconnect
        if (!DeviceConfigState.wifiConnected)
        {
            DeviceConfigState.state = ConfigurationState::CONFIG_WIFI;
            DeviceConfigState.wifiConnected = wifiConnect(DeviceConfig.wifi_sta_ssid, DeviceConfig.wifi_sta_pwd);
            if (DeviceConfigState.wifiConnected)
            {
                configDeviceFromWiFiConn();
                Serial.println("CommsManager: WiFi reconnected successfully");
                CommsManagerState.wifiFailCount = 0;
                CommsManagerState.preferredComm = CommsManagerState.PreferredComm::WIFI;
                return;
            }
        }
    }

    if (attemptGSM && DeviceConfig.useGSM && !CommsManagerState.gsmOnline)
    {
        Serial.println("CommsManager: Attempting GSM reconnection...");
        CommsManagerState.lastGSMAttempt = now;
        CommsManagerState.gsmFailCount++;

        // For GSM, attempt to wake and reconnect
        if (!DeviceConfigState.gsmConnected || !DeviceConfigState.gsmInternetAvailable)
        {
            DeviceConfigState.state = ConfigurationState::CONFIG_GSM;
            initializeAndConfigGSM();
            if (DeviceConfigState.gsmInternetAvailable)
            {
                Serial.println("CommsManager: GSM reconnected successfully");
                CommsManagerState.gsmFailCount = 0;
                CommsManagerState.preferredComm = CommsManagerState.PreferredComm::GSM;
                return;
            }
        }
    }

    // Increase reconnect interval with each failure (exponential backoff: 30s, 60s, 120s, etc.)
    if (CommsManagerState.wifiFailCount > 0 || CommsManagerState.gsmFailCount > 0)
    {
        uint8_t maxFailCount = max(CommsManagerState.wifiFailCount, CommsManagerState.gsmFailCount);
        CommsManagerState.reconnectInterval = 30000 * (1 << min(maxFailCount, (uint8_t)4)); // Cap at 8 minutes
    }

    // If both have exceeded max retries, mark all comms as unavailable
    if (CommsManagerState.wifiFailCount >= CommsManagerState.MAX_RETRY_ATTEMPTS &&
        CommsManagerState.gsmFailCount >= CommsManagerState.MAX_RETRY_ATTEMPTS)
    {
        CommsManagerState.allCommsUnavailable = true;
        CommsManagerState.preferredComm = CommsManagerState.PreferredComm::NONE;
        CommsManagerState.maxReconnectAttemptsReached = true;
        Serial.println("CommsManager: All communication methods have failed. Giving up on reconnection attempts.");
    }
}

/**
 * @brief Communication Manager - runs in main loop
 * @details Manages communication device selection, monitors connectivity, and handles failover
 *          Should be called frequently from loop() to maintain up-to-date communication state
 */
void commsManager()
{
    static unsigned long lastCommsCheck = 0;
    if (millis() - lastCommsCheck < 60000 * 15)
        return;
    lastCommsCheck = millis();
    if (CommsManagerState.preferredComm == CommsManagerState.PreferredComm::NONE)
    {
        // If all comms are unavailable, attempt to update connectivity status and preference
        Serial.print("[CommsManager]: No communication methods available: [Reason]: ");
        if (CommsManagerState.maxReconnectAttemptsReached)
        {
            Serial.println("Max reconnect attempts reached for all communication methods. No further attempts will be made until next device restart.");
        }
        else if (!DeviceConfig.useWiFi && !DeviceConfig.useGSM)
        {
            Serial.println("All communication methods are disabled in configuration. Please enable at least one communication method to allow data transmission.");
        }

        return;
    }
    // Set initial preferred comms based on configuration
    if (DeviceConfig.useWiFi && DeviceConfigState.wifiConnected || CommunicationPriority::WIFI == 0)
    {
        CommsManagerState.preferredComm = CommsManagerState.PreferredComm::WIFI;
    }
    else if (DeviceConfig.useGSM && DeviceConfigState.gsmConnected || CommunicationPriority::GSM == 0)
    {
        CommsManagerState.preferredComm = CommsManagerState.PreferredComm::GSM;
    }

