CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
        return true;
    }
    catch (...)
    {
        Serial.println("buildMQTTTelemetryPayload: Exception occurred while building payload");
        return false;
    }
}

/// @brief Send telemetry data to MQTT broker
/// @param broker MQTT broker hostname/IP address
/// @param port MQTT broker port (default 1883)
/// @param client_id MQTT client ID (0-5)
/// @param topic MQTT topic to publish to
/// @param username MQTT username (optional)
/// @param password MQTT password (optional)
/// @return true if telemetry sent successfully, false otherwise
bool sendGsmMQTTTelemetry(const char *broker, uint16_t port, uint8_t client_id, const char *topic,
                          const char *username = nullptr, const char *password = nullptr)
{
    // Check if GPRS is available (required for MQTT over GSM)
    if (!CommsManagerState.gsmOnline)
    {
        Serial.println("sendMQTTTelemetry: GPRS not connected - cannot send telemetry");
        return false;
    }
    bool isBrokerConnected = MQTT_isBrokerConnected(client_id);
    bool isClientConneted = MQTT_isClientConnected(client_id);
    // Open broker connection
    if (!isBrokerConnected)
    {
        Serial.println("sendMQTTTelemetry: Opening MQTT broker connection...");
        if (!MQTT_open(client_id, broker, port))
        {
            Serial.print("sendMQTTTelemetry: Failed to open MQTT broker - Error: ");
            Serial.println(MQTT_INIT_ERROR);
            return false;
        }
        MQTT_connect(MQTT_CLIENT_ID, esp_chipid, MQTT_USERNAME, MQTT_PASSWORD);
        MQTT_isBrokerConnected(client_id);
    }
    else if (!isClientConneted)
    {
        Serial.println("sendMQTTTelemetry: Connecting MQTT client...");
        if (!MQTT_connect(client_id, esp_chipid, username, password))
        {
            Serial.print("sendMQTTTelemetry: Failed to connect MQTT client - Error: ");
            Serial.println(MQTT_INIT_ERROR);
            return false;
        }
    }

    // Build telemetry payload
    char mqtt_payload[2048] = {}; // Large buffer for comprehensive telemetry
    if (!buildMQTTTelemetryPayload(mqtt_payload, sizeof(mqtt_payload)))
    {
        Serial.println("sendMQTTTelemetry: Failed to build telemetry payload");
        return false;
    }

    Serial.print("sendMQTTTelemetry: Payload size: ");
    Serial.print(strlen(mqtt_payload));
    Serial.println(" bytes");

    // Publish telemetry
    Serial.print("sendMQTTTelemetry: Publishing to topic: ");
    Serial.println(topic);

    if (!MQTT_publish(client_id, 1, topic, mqtt_payload, 1, 0))
    {
        Serial.println("sendMQTTTelemetry: Failed to publish telemetry");
        return false;
    }

    Serial.println("sendMQTTTelemetry: Telemetry published successfully");
    count_sends++;
    return true;
}

/// @brief Initialize MQTT and send telemetry, with automatic cleanup
/// @param broker MQTT broker hostname/IP
/// @param port MQTT broker port
/// @param topic MQTT topic for telemetry
/// @param client_id MQTT client ID
/// @param username MQTT username (optional)
/// @param password MQTT password (optional)
/// @param disconnect_after If true, disconnect and close broker after sending
/// @return true if successful, false otherwise
bool initAndSendMQTTTelemetry(const char *broker, uint16_t port, const char *topic, uint8_t client_id = 0,
                              const char *username = nullptr, const char *password = nullptr,
                              bool disconnect_after = true)
{
    bool result = sendGsmMQTTTelemetry(broker, port, client_id, topic, username, password);

    if (disconnect_after && MQTT_isBrokerConnected(client_id))
    {
        delay(500);
        Serial.println("initAndSendMQTTTelemetry: Disconnecting MQTT...");
        MQTT_disconnect(client_id);
    }

    return result;
}

/// @brief Send telemetry data to MQTT broker via WiFi (PubSubClient)
/// @param broker MQTT broker hostname/IP address
/// @param port MQTT broker port (default 1883)
/// @param client_id MQTT client ID
/// @param topic MQTT topic to publish to
/// @param username MQTT username (optional)
/// @param password MQTT password (optional)
/// @return true if telemetry sent successfully, false otherwise
bool sendWiFiMQTTTelemetry(const char *broker, uint16_t port, const char *client_id, const char *topic,
                           const char *username = nullptr, const char *password = nullptr)
{
    // Check if WiFi is connected
    if (WiFi.status() != WL_CONNECTED)
    {
        Serial.println("sendWiFiMQTTTelemetry: WiFi not connected - cannot send telemetry");
        return false;
    }

    Serial.println("sendWiFiMQTTTelemetry: WiFi connected, proceeding with MQTT publish");

    // Build telemetry payload
    char mqtt_payload[2048] = {}; // Large buffer for comprehensive telemetry
    if (!buildMQTTTelemetryPayload(mqtt_payload, sizeof(mqtt_payload)))
    {
        Serial.println("sendWiFiMQTTTelemetry: Failed to build telemetry payload");
        return false;
    }

    Serial.print("sendWiFiMQTTTelemetry: Payload size: ");
    Serial.print(strlen(mqtt_payload));
    Serial.println(" bytes");

    // Send telemetry via WiFi MQTT
    bool result = wifiMQTTSendTelemetry(broker, port, topic, client_id, mqtt_payload, username, password, false);

    if (result)
    {
        Serial.println("sendWiFiMQTTTelemetry: Telemetry sent successfully via WiFi");
        count_sends++;
    }
    else
    {
        Serial.println("sendWiFiMQTTTelemetry: Failed to send telemetry via WiFi");
    }

    return result;
}

void buildDeviceInfoJSON()
{
    try
    {
        // Clear previous data
        device_info.clear();

        // Add GSM configuration if GSM is capable and has valid data
        if (gsm_capable && (GSMRuntimeInfo.operator_name.length() > 0 ||
                            GSMRuntimeInfo.imei.length() > 0 ||
                            GSMRuntimeInfo.sim_ccid[0] != '\0'))
        {
            JsonObject gsm = device_info["GSM"].to<JsonObject>();

            if (GSMRuntimeInfo.operator_name.length() > 0)
                gsm["Operator Name"] = GSMRuntimeInfo.operator_name;
            if (GSMRuntimeInfo.signal_strength > 0)
                gsm["Signal Strength"] = GSMRuntimeInfo.signal_strength;
            if (GSMRuntimeInfo.network_technology[0] != '\0')
                gsm["Network Technology"] = GSMRuntimeInfo.network_technology;
            if (GSMRuntimeInfo.imei.length() > 0)
                gsm["IMEI"] = GSMRuntimeInfo.imei;
            if (GSMRuntimeInfo.model_id.length() > 0)
                gsm["Model"] = GSMRuntimeInfo.model_id;
            if (GSMRuntimeInfo.firmware_version.length() > 0)
                gsm["Firmware"] = GSMRuntimeInfo.firmware_version;
            if (GSMRuntimeInfo.sim_ccid[0] != '\0')
                gsm["SIM CCID"] = GSMRuntimeInfo.sim_ccid;
        }

        // Add WiFi configuration if WiFi is connected and has valid data
        if (wifi_info["SSID"].as<String>().length() > 0 ||
            wifi_info["IP Address"].as<String>().length() > 0)
        {
            JsonObject wifi = device_info["WIFI"].to<JsonObject>();

