CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
            if (wifi_info["SSID"].as<String>().length() > 0)
                wifi["SSID"] = wifi_info["SSID"];
            if (wifi_info["BSSID"].as<String>().length() > 0)
                wifi["BSSID"] = wifi_info["BSSID"];
            if (wifi_info["Signal Strength"].as<int>() != 0)
                wifi["Signal Strength"] = wifi_info["Signal Strength"];
            if (wifi_info["IP Address"].as<String>().length() > 0)
                wifi["IP Address"] = wifi_info["IP Address"];
        }

        Serial.println("buildDeviceInfoJSON: Device info JSON built successfully");
    }
    catch (...)
    {
        Serial.println("buildDeviceInfoJSON: Exception occurred while building device info JSON");
    }
}

void checkIncomingMQTTMessages()
{
    if (CommsManagerState.preferredComm == CommsManagerState.PreferredComm::NONE)
        return;

    if (CommsManagerState.preferredComm == CommsManagerState.PreferredComm::WIFI && CommsManagerState.wifiOnline && CommsManagerState.mqttConnectionInitialized)
    {
        if (!mqttClient.connected())
        {
            if (wifiMQTTConnect(MQTT_BROKER, MQTT_PORT, esp_chipid, MQTT_USERNAME, MQTT_PASSWORD))
                mqttClient.subscribe(MQTT_SUBSCRIBE_TOPIC);
        }

        mqttClient.loop();
    }

    else if (CommsManagerState.preferredComm == CommsManagerState::GSM && CommsManagerState.gsmOnline)
    {
        if (!MQTT_isBrokerConnected(MQTT_CLIENT_ID))
        {
            MQTT_configure(MQTT_CLIENT_ID, 1, 1);
            if (!MQTT_open(MQTT_CLIENT_ID, MQTT_BROKER, MQTT_PORT))
            {
                Serial.print("receiveMQTTTelemetry: Failed to open MQTT broker - Error: ");
                Serial.println(MQTT_INIT_ERROR);
                return;
            }
            MQTT_connect(MQTT_CLIENT_ID, esp_chipid, MQTT_USERNAME, MQTT_PASSWORD);
            MQTT_subscribe(MQTT_CLIENT_ID, 1, MQTT_SUBSCRIBE_TOPIC, 0);
        }
        else if (!MQTT_isClientConnected(MQTT_CLIENT_ID))
        {
            Serial.println("receiveMQTTTelemetry: Connecting MQTT client...");
            if (!MQTT_connect(MQTT_CLIENT_ID, esp_chipid, MQTT_USERNAME, MQTT_PASSWORD))
            {
                Serial.print("receiveMQTTTelemetry: Failed to connect MQTT client - Error: ");
                Serial.println(MQTT_INIT_ERROR);
                return;
            }
            MQTT_subscribe(MQTT_CLIENT_ID, 1, MQTT_SUBSCRIBE_TOPIC, 0);
        }

        if (MQTT_hasBufferedMessage(MQTT_CLIENT_ID))
        {
            CommsManagerState.message_received = MQTT_readBufferedMessage(MQTT_CLIENT_ID, incoming_topic_store, sizeof(incoming_topic_store), incoming_message_store, sizeof(incoming_message_store));
        }
    }
}

void wifiMQTTCallback(char *topic, byte *payload, unsigned int length)
{
    if (strcmp(topic, MQTT_SUBSCRIBE_TOPIC) == 0)
    {
        Serial.println("wifiMQTTCallback: Received configuration update");
        // ToDO: Process configuration update (e.g., parse JSON and apply settings)
        CommsManagerState.message_received = true;
    }
    int topic_len = strlen(topic);
    if ((topic_len < sizeof(incoming_topic_store)) && (length < sizeof(incoming_message_store)))
    {
        strcpy(incoming_topic_store, topic);
        incoming_topic_store[topic_len] = '\0';
        memcpy(incoming_message_store, payload, length);
        incoming_message_store[length] = '\0';
    }

    String dbg = "wifiMQTTCallback: Message | topic: " + String(topic) + "| Payload length:" + "| Payload: " + String((char *)payload, length);
    Serial.println(dbg);
}

void processIncomingData()
{

    if (!strstr(incoming_message_store, esp_chipid))
    {
        CommsManagerState.message_received = false;
        return;
    }
    JsonDocument doc;
    if (validateJson(incoming_message_store))
    {
        deserializeJson(doc, incoming_message_store);
    }
    else
    {
        CommsManagerState.message_received = false;
        return;
    }

    auto hasString = [&](JsonVariant v)
    {
        return !v.isNull() && v.is<const char *>() && v.as<const char *>()[0] != '\0';
    };

    if (hasString(doc["action"]))
    {
        if (doc["action"] == "restart")
        {
            Serial.println("Device restarting from remote command...");
            delay(2000);
            ESP.restart();
        }
    }

    CommsManagerState.message_received = false; //! Very important
}
